# Data cleaning

In [36]:
# importing needed libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
#Loading the dataset
df = pd.read_csv('../data/new_retail_data.csv',parse_dates=["Date"])

In [38]:
df.shape

(302010, 30)

In [39]:
df.head()

,Transaction_ID,Customer_ID,Name,Email,Phone,Address,City,State,Zipcode,Country,...,Total_Amount,Product_Category,Product_Brand,Product_Type,Feedback,Shipping_Method,Payment_Method,Order_Status,Ratings,products
0,8691788.0,37249.0,Michelle Harrington,Ebony39@gmail.com,1.414787e+09,3959 Amanda Burgs,Dortmund,Berlin,77985.0,Germany,...,324.086270,Clothing,Nike,Shorts,Excellent,Same-Day,Debit Card,Shipped,5.0,Cycling shorts
1,2174773.0,69749.0,Kelsey Hill,Mark36@gmail.com,6.852900e+09,82072 Dawn Centers,Nottingham,England,99071.0,UK,...,806.707815,Electronics,Samsung,Tablet,Excellent,Standard,Credit Card,Processing,4.0,Lenovo Tab
2,6679610.0,30192.0,Scott Jensen,Shane85@gmail.com,8.362160e+09,4133 Young Canyon,Geelong,New South Wales,75929.0,Australia,...,1063.432799,Books,Penguin Books,Children's,Average,Same-Day,Credit Card,Processing,2.0,Sports equipment
3,7232460.0,62101.0,Joseph Miller,Mary34@gmail.com,2.776752e+09,8148 Thomas Creek Suite 100,Edmonton,Ontario,88420.0,Canada,...,2466.854021,Home Decor,Home Depot,Tools,Excellent,Standard,PayPal,Processing,4.0,Utility knife
4,4983775.0,27901.0,Debra Coleman,Charles30@gmail.com,9.098268e+09,5813 Lori Ports Suite 269,Bristol,England,48704.0,UK,...,248.553049,Grocery,Nestle,Chocolate,Bad,Standard,Cash,Shipped,1.0,Chocolate cookies

In [40]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 302010 entries, 0 to 302009
Data columns (total 30 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Transaction_ID    301677 non-null  float64
 1   Customer_ID       301702 non-null  float64
 2   Name              301628 non-null  object
 3   Email             301663 non-null  object
 4   Phone             301648 non-null  float64
 5   Address           301695 non-null  object
 6   City              301762 non-null  object
 7   State             301729 non-null  object
 8   Zipcode           301670 non-null  float64
 9   Country           301739 non-null  object
 10  Age               301837 non-null  float64
 11  Gender            301693 non-null  object
 12  Income            301720 non-null  object
 13  Customer_Segment  301795 non-null  object
 14  Date              301651 non-null  datetime64[ns]
 15  Year              301660 non-null  float64
 16  Month             301737 non-null  object
 17  Time              301660 non-null  object
 18  Total_Purchases   301649 non-null  float64
 19  Amount            301653 non-null  float64
 20  Total_Amount      301660 non-null  float64
 21  Product_Category  301727 non-null  object
 22  Product_Brand     301729 non-null  object
 23  Product_Type      302010 non-null  object
 24  Feedback          301826 non-null  object
 25  Shipping_Method   301673 non-null  object
 26  Payment_Method    301713 non-null  object
 27  Order_Status      301775 non-null  object
 28  Ratings           301826 non-null  float64
 29  products          302010 non-null  object
dtypes: datetime64[ns](1), float64(10), object(19)
memory usage: 69.1+ MB

In [43]:
df_clean = df.drop_duplicates(keep='first')
df = df_clean

In [7]:
cat_cols = df.select_dtypes(include="object").columns

for col in cat_cols:
    print(f"\n--- {col.upper()} ---")
    print(df[col].value_counts(dropna=False).head(30))

--- NAME ---
Name
NaN                    382
Michael Smith          144
Michael Johnson        111
Michael Jones          102
Christopher Smith       93
Michael Williams        91
Jennifer Smith          91
James Smith             89
Robert Smith            88
John Smith              84
David Smith             81
James Johnson           79
Joseph Smith            77
Michael Brown           76
Jennifer Johnson        75
David Williams          74
John Johnson            73
Jessica Smith           69
Jennifer Williams       68
David Johnson           68
William Smith           68
Christopher Johnson     66
John Williams           65
Michael Davis           64
Jennifer Brown          61
Michael Miller          60
James Jones             59
James Williams          59
Amanda Smith            58
Jessica Johnson         58
Name: count, dtype: int64

--- EMAIL ---
Email
NaN                    347
Michael59@gmail.com     93
Michael95@gmail.com     92
Michael17@gmail.com     90
Michael39@gmail.com     87
Michael50@gmail.com     84
Michael58@gmail.com     84
Michael55@gmail.com     83
Michael93@gmail.com     83
Michael49@gmail.com     82
Michael40@gmail.com     82
Michael90@gmail.com     82
Michael56@gmail.com     81
Michael60@gmail.com     81
Michael30@gmail.com     81
Michael74@gmail.com     81
Michael9@gmail.com      80
Michael70@gmail.com     80
Michael80@gmail.com     78
Michael34@gmail.com     77
Michael19@gmail.com     77
Michael82@gmail.com     77
Michael10@gmail.com     76
Michael28@gmail.com     76
Michael32@gmail.com     76
Michael98@gmail.com     76
Michael73@gmail.com     75
Michael4@gmail.com      75
Michael16@gmail.com     75
Michael35@gmail.com     75
Name: count, dtype: int64

--- ADDRESS ---
Address
NaN                                  315
6135 Tiffany Cliff Apt. 861            2
6001 Taylor Unions                     2
313 Shane Hollow Apt. 210              2
29041 Beck Junction                    2
2537 Collins Vista Apt. 444            2
8690 Oconnell Crescent                 2
16322 Jennifer Canyon Apt. 847         2
02612 Amanda Junction Suite 242        2
99722 Ortiz Burgs Apt. 761             2
24792 Thompson Walk                    2
4997 Johnson Plain                     2
39717 Clay Lights Suite 201            2
095 Jordan Lodge Apt. 986              2
93462 Janet Springs                    2
53753 Christopher Stream Apt. 321      2
636 Martin Mills                       2
20453 Anthony Drive Apt. 897           2
7413 Glenn Row                         2
285 Amy Inlet Suite 622                2
67911 Scott Tunnel Suite 757           2
671 Jessica Square                     2
68118 Cruz Mill                        2
910 Wolfe Trail                        2
59440 Peter Alley Apt. 069             2
752 Randall Points                     2
83360 Russell Vista                    2
42343 Green Ville                      2
011 Larry Manor Apt. 866               2
365 Elliott Forks                      2
Name: count, dtype: int64

--- CITY ---
City
Chicago          21652
Portsmouth       20131
San Francisco    12188
Frankfurt        10182
Boston            9416
New York          5455
Fort Worth        5206
London            4481
Winnipeg          2406
Birmingham        2382
Mackay            2357
Calgary           2348
Geelong           2340
Edmonton          2339
Victoria          2325
Leeds             2322
Edinburgh         2317
Bendigo           2316
Hobart            2308
Perth             2307
Plymouth          2306
Townsville        2302
Darwin            2298
Toronto           2297
Brisbane          2297
Stuttgart         2296
Bielefeld         2296
Saskatoon         2293
Hanover           2291
Munich            2290
Name: count, dtype: int64

--- STATE ---
State
England            63059
Berlin             52822
New South Wales    45317
Ontario            45312
Connecticut        21658
Maine              12193
Georgia             9504
Kansas              5516
New Mexico          5199
New York             996
Maryland             980
Pennsylvania         966
Texas                953
California           952
Nevada               949
South Carolina       945
Minnesota            945
West Virginia        944
Iowa                 944
Ohio                 941
Illinois             941
Mississippi          938
Hawaii               936
Louisiana            928
Utah                 924
Michigan             923
Virginia             918
New Jersey           918
Alabama              909
Montana              906
Name: count, dtype: int64

--- COUNTRY ---
Country
USA          95223
UK           63066
Germany      52830
Australia    45319
Canada       45301
NaN            271
Name: count, dtype: int64

--- GENDER ---
Gender
Male      187599
Female    114094
NaN          317
Name: count, dtype: int64

--- INCOME ---
Income
Medium    130230
Low        96261
High       75229
NaN          290
Name: count, dtype: int64

--- CUSTOMER_SEGMENT ---
Customer_Segment
Regular    146221
New         91187
Premium     64387
NaN           215
Name: count, dtype: int64

--- MONTH ---
Month
April        41301
January      37284
August       33012
July         30886
May          28331
March        19142
October      19126
December     18945
September    18655
November     18416
June         18380
February     18259
NaN            273
Name: count, dtype: int64

--- TIME ---
Time
NaN         350
2:16:01      14
15:54:27     14
2:55:36      14
7:45:07      14
19:04:26     13
3:02:22      13
13:54:41     13
16:03:12     13
22:28:22     13
2:18:09      13
1:17:32      13
18:10:53     13
8:54:31      13
5:08:26      12
21:20:13     12
13:48:17     12
15:40:41     12
16:13:01     12
6:47:57      12
11:59:44     12
18:51:01     12
10:39:19     12
1:51:30      12
12:03:15     12
1:58:35      12
19:58:50     12
8:43:27      12
10:21:09     12
8:41:28      12
Name: count, dtype: int64

--- PRODUCT_CATEGORY ---
Product_Category
Electronics    71196
Grocery        66786
Clothing       54741
Books          54622
Home Decor     54382
NaN              283
Name: count, dtype: int64

--- PRODUCT_BRAND ---
Product_Brand
Pepsi                30292
Coca-Cola            18392
Samsung              18376
Zara                 18370
HarperCollins        18353
Sony                 18319
Bed Bath & Beyond    18244
Adidas               18238
Home Depot           18145
Nike                 18139
Penguin Books        18138
Random House         18122
Nestle               18109
Apple                18073
IKEA                 17994
Whirepool             7445
Mitsubhisi            6724
BlueStar              2256
NaN                    281
Name: count, dtype: int64

--- PRODUCT_TYPE ---
Product_Type
Water                                 24459
Smartphone                            18468
Non-Fiction                           18172
Fiction                               18045
Juice                                 12230
Television                            12197
T-shirt                               12181
Decorations                           12178
Shoes                                 12140
Tablet                                12091
Soft Drink                            12036
Furniture                             11969
Fridge                                 7445
Mitsubishi 1.5 Ton 3 Star Split AC     6724
Thriller                               6262
Kitchen                                6228
Coffee                                 6178
Children's                             6147
Jeans                                  6134
Shirt                                  6132
Dress                                  6123
Shorts                                 6087
Headphones                             6080
Lighting                               6075
Chocolate                              6051
Literature                             6051
Bathroom                               6026
Bedding                                6011
Jacket                                 6004
Laptop                                 5981
Name: count, dtype: int64

--- FEEDBACK ---
Feedback
Excellent    100755
Good          95098
Average       62674
Bad           43299
NaN             184
Name: count, dtype: int64

--- SHIPPING_METHOD ---
Shipping_Method
Same-Day    104156
Express     102356
Standard     95161
NaN            337
Name: count, dtype: int64

--- PAYMENT_METHOD ---
Payment_Method
Credit Card    90116
Debit Card     76790
Cash           73810
PayPal         60997
NaN              297
Name: count, dtype: int64

--- ORDER_STATUS ---
Order_Status
Delivered     130449
Shipped        65024
Processing     57199
Pending        49103
NaN              235
Name: count, dtype: int64

--- PRODUCTS ---
products
Spring water          2508
Bottled water         2496
Mystery               2496
Artesian water        2478
Distilled water       2475
Alkaline water        2448
Adventure             2436
Mineral water         2431
Coconut water         2424
Flavored water        2424
Sparkling water       2400
Purified water        2375
Literary fiction      2333
Motorola Moto         1963
History               1897
Google Pixel          1893
Self-help             1893
Horror                1867
Samsung Galaxy        1863
Travel                1861
Historical fiction    1860
Biography             1852
iPhone                1843
Sony Xperia           1837
OnePlus               1837
Xiaomi Mi             1834
Cooking               1822
Huawei P              1816
Fantasy               1806
Psychology            1800
Name: count, dtype: int64

In [8]:
#These are safe to drop
drop_cols = [
    "Transaction_ID",
    "Customer_ID",
    "Name",
    "Email",
    "Phone",
    "Address",
    "City",
    "Zipcode",
    "Age",
    "Gender",
    "Income",
    "Customer_Segment",
    "Year",          # not needed we will extract this later from Date
    "Month",         # not needed we will extract this later from Date
    "Time",
    "Amount",
    "Total_Amount",
    "Feedback",
    "Shipping_Method",
    "Payment_Method",
    "Order_Status",
    "Ratings"
]


df = df.drop(columns=[c for c in drop_cols if c in df.columns])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 302010 entries, 0 to 302009
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   State             301729 non-null  object
 1   Country           301739 non-null  object
 2   Date              301651 non-null  datetime64[ns]
 3   Total_Purchases   301649 non-null  float64
 4   Product_Category  301727 non-null  object
 5   Product_Brand     301729 non-null  object
 6   Product_Type      302010 non-null  object
 7   products          302010 non-null  object
dtypes: datetime64[ns](1), float64(1), object(6)
memory usage: 18.4+ MB

In [9]:
df.isnull().sum()

State               281
Country             271
Date                359
Total_Purchases     361
Product_Category    283
Product_Brand       281
Product_Type          0
products              0
dtype: int64

In [10]:
cols_required = [
    'Date',
    'products',
    'Total_Purchases',
    'Product_Category',
    'Product_Brand',
    'Product_Type',
    'Country',
    'State'
]

df_clean = df.dropna(subset=cols_required).reset_index(drop=True)
df=df_clean

In [11]:
# Fill missing categorical values
cat_cols = ["State","Country",
            "Product_Category","Product_Brand","Product_Type","products"]

for col in cat_cols:
    df[col] = df[col].astype(str).str.lower().str.strip()

In [12]:
# Fix spelling errors in Product Brand
df["Product_Brand"] = df["Product_Brand"].replace({
    "whirepool": "whirlpool",
    "mitsubhisi": "mitsubishi",
    "bluestar": "blue star"
})

In [13]:
#"uk" â†’ "united kingdom"

df["Country"] = df["Country"].replace({
    "uk": "united kingdom"
})

In [14]:
# Convert "home decor" â†’ "home_decor"
# Spaces in category names can cause issues in ML encoding.

df["Product_Category"] = df["Product_Category"].str.replace(" ", "_")

In [15]:
# Convert "blue star" â†’ "blue_star"

df["Product_Brand"] = df["Product_Brand"].str.replace(" ", "_")

In [16]:
# Replace spaces with underscores:

df["Product_Type"] = df["Product_Type"].str.replace(" ", "_")

In [17]:
# Because models do better with clean tokens:

df["products"] = (
    df["products"]
    .str.lower()
    .str.strip()
    .str.replace(" ", "_")
    .str.replace("[^a-zA-Z0-9_]", "", regex=True)
)

In [18]:
# Unique values + counts for "products"
print("\nðŸ”¹ Unique Products and Their Counts:")
product_counts = df['products'].value_counts()
print(product_counts)
print("\nTotal unique products:", product_counts.shape[0])

# Unique values + counts for "Product_Type"
print("\nðŸ”¹ Unique Product Types and Their Counts:")
ptype_counts = df['Product_Type'].value_counts()
print(ptype_counts)
print("\nTotal unique product types:", ptype_counts.shape[0])

ðŸ”¹ Unique Products and Their Counts:
products
spring_water       2499
bottled_water      2490
mystery            2484
distilled_water    2463
artesian_water     2463
                   ...
screwdriver_set     556
towel_rack          555
razer_blade         552
parka               545
package_ac          223
Name: count, Length: 318, dtype: int64

Total unique products: 318

ðŸ”¹ Unique Product Types and Their Counts:
Product_Type
water                                 24352
smartphone                            18358
non-fiction                           18065
fiction                               17954
juice                                 12157
television                            12120
decorations                           12104
t-shirt                               12103
shoes                                 12067
tablet                                12014
soft_drink                            11960
furniture                             11901
fridge                                 7407
mitsubishi_1.5_ton_3_star_split_ac     6697
thriller                               6220
kitchen                                6188
coffee                                 6139
children's                             6099
shirt                                  6093
jeans                                  6084
dress                                  6080
headphones                             6047
shorts                                 6042
lighting                               6033
chocolate                              6019
literature                             6019
bathroom                               5985
bedding                                5984
jacket                                 5958
laptop                                 5936
tools                                  5897
snacks                                 5849
bluestar_ac                            2248
Name: count, dtype: int64

Total unique product types: 33

In [19]:
df.head(10)

,State,Country,Date,Total_Purchases,Product_Category,Product_Brand,Product_Type,products
0,berlin,germany,2023-09-18,3.0,clothing,nike,shorts,cycling_shorts
1,england,united kingdom,2023-12-31,2.0,electronics,samsung,tablet,lenovo_tab
2,new south wales,australia,2023-04-26,3.0,books,penguin_books,children's,sports_equipment
3,ontario,canada,2023-05-08,7.0,home_decor,home_depot,tools,utility_knife
4,england,united kingdom,2024-01-10,2.0,grocery,nestle,chocolate,chocolate_cookies
5,new south wales,australia,2023-09-21,4.0,electronics,apple,tablet,lenovo_tab
6,ontario,canada,2023-06-26,2.0,electronics,samsung,television,qled_tv
7,berlin,germany,2023-03-24,1.0,clothing,zara,shirt,dress_shirt
8,new south wales,australia,2024-01-06,8.0,grocery,nestle,chocolate,dark_chocolate
9,berlin,germany,2023-10-04,10.0,home_decor,home_depot,decorations,candles

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300179 entries, 0 to 300178
Data columns (total 8 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   State             300179 non-null  object
 1   Country           300179 non-null  object
 2   Date              300179 non-null  datetime64[ns]
 3   Total_Purchases   300179 non-null  float64
 4   Product_Category  300179 non-null  object
 5   Product_Brand     300179 non-null  object
 6   Product_Type      300179 non-null  object
 7   products          300179 non-null  object
dtypes: datetime64[ns](1), float64(1), object(6)
memory usage: 18.3+ MB

In [21]:
df.describe()

                                Date  Total_Purchases
count                         300179    300179.000000
mean   2023-08-30 16:23:04.933656320         5.359935
min              2023-03-01 00:00:00         1.000000
25%              2023-05-31 00:00:00         3.000000
50%              2023-08-31 00:00:00         5.000000
75%              2023-11-30 00:00:00         8.000000
max              2024-02-29 00:00:00        10.000000
std                              NaN         2.868481

In [22]:
# converting from product name to unique product ID
df['product_id'] = df['products'].astype('category').cat.codes

In [23]:
df['Date'] = pd.to_datetime(df['Date'])
df['Year'] = df['Date'].dt.year
df['Month'] = df['Date'].dt.month
df['DayOfWeek'] = df['Date'].dt.dayofweek
df['IsMonthStart'] = df['Date'].dt.is_month_start.astype(int)
df['IsMonthEnd'] = df['Date'].dt.is_month_end.astype(int)

In [24]:
df.sample(5)

,State,Country,Date,Total_Purchases,Product_Category,Product_Brand,Product_Type,products,product_id,Year,Month,DayOfWeek,IsMonthStart,IsMonthEnd
34081,new south wales,australia,2023-10-02,1.0,books,penguin_books,non-fiction,memoir,178,2023,10,0,0,0
153500,georgia,usa,2023-06-23,2.0,electronics,sony,smartphone,sony_xperia,266,2023,6,4,0,0
227877,south dakota,usa,2023-08-03,6.0,books,random_house,literature,short_stories,253,2023,8,3,0,0
242067,england,united kingdom,2023-05-21,1.0,home_decor,ikea,furniture,bookshelf,36,2023,5,6,0,0
224038,berlin,germany,2023-04-05,5.0,books,penguin_books,non-fiction,memoir,178,2023,4,2,0,0

In [25]:
df.isnull().sum()

State               0
Country             0
Date                0
Total_Purchases     0
Product_Category    0
Product_Brand       0
Product_Type        0
products            0
product_id          0
Year                0
Month               0
DayOfWeek           0
IsMonthStart        0
IsMonthEnd          0
dtype: int64

In [26]:
df.shape

(300179, 14)

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300179 entries, 0 to 300178
Data columns (total 14 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   State             300179 non-null  object
 1   Country           300179 non-null  object
 2   Date              300179 non-null  datetime64[ns]
 3   Total_Purchases   300179 non-null  float64
 4   Product_Category  300179 non-null  object
 5   Product_Brand     300179 non-null  object
 6   Product_Type      300179 non-null  object
 7   products          300179 non-null  object
 8   product_id        300179 non-null  int16
 9   Year              300179 non-null  int32
 10  Month             300179 non-null  int32
 11  DayOfWeek         300179 non-null  int32
 12  IsMonthStart      300179 non-null  int64
 13  IsMonthEnd        300179 non-null  int64
dtypes: datetime64[ns](1), float64(1), int16(1), int32(3), int64(2), object(6)
memory usage: 26.9+ MB

In [28]:
df.to_csv('../data/cleaned_retail_data.csv', index=False)

In [29]:
df.head()

,State,Country,Date,Total_Purchases,Product_Category,Product_Brand,Product_Type,products,product_id,Year,Month,DayOfWeek,IsMonthStart,IsMonthEnd
0,berlin,germany,2023-09-18,3.0,clothing,nike,shorts,cycling_shorts,86,2023,9,0,0,0
1,england,united kingdom,2023-12-31,2.0,electronics,samsung,tablet,lenovo_tab,164,2023,12,6,0,1
2,new south wales,australia,2023-04-26,3.0,books,penguin_books,children's,sports_equipment,270,2023,4,2,0,0
3,ontario,canada,2023-05-08,7.0,home_decor,home_depot,tools,utility_knife,303,2023,5,0,0,0
4,england,united kingdom,2024-01-10,2.0,grocery,nestle,chocolate,chocolate_cookies,58,2024,1,2,0,0